tonyao-/coreipm/coreipm/lpc23nn.h
/*
-------------------------------------------------------------------------------
coreIPM/lpc23nn.h

Author: Gokhan Sozmen
-------------------------------------------------------------------------------
Copyright (C) 2007-2008 Gokhan Sozmen
-------------------------------------------------------------------------------
coreIPM is free software; you can redistribute it and/or modify it under the 
terms of the GNU General Public License as published by the Free Software
Foundation; either version 2 of the License, or (at your option) any later 
version.

coreIPM is distributed in the hope that it will be useful, but WITHOUT ANY
WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A
PARTICULAR PURPOSE. See the GNU General Public License for more details.

You should have received a copy of the GNU General Public License along with 
coreIPM; if not, write to the Free Software Foundation, Inc., 51 Franklin
Street, Fifth Floor, Boston, MA 02110-1301, USA.
-------------------------------------------------------------------------------
See http://www.coreipm.com for documentation, latest information, licensing, 
support and contact details.
-------------------------------------------------------------------------------
*/
#ifndef lpc210x_h
#define lpc210x_h

#define REG32 (volatile unsigned int*)

#define VICIRQStatus    (*(REG32 (0xFFFFF000)))
#define VICFIQStatus    (*(REG32 (0xFFFFF004)))
#define VICRawIntr      (*(REG32 (0xFFFFF008)))
#define VICIntSelect    (*(REG32 (0xFFFFF00C)))
#define VICIntEnable    (*(REG32 (0xFFFFF010)))
#define VICIntEnClear   (*(REG32 (0xFFFFF014)))
#define VICIntEnClr     VICIntEnClear
#define VICSoftInt      (*(REG32 (0xFFFFF018)))
#define VICSoftIntClear (*(REG32 (0xFFFFF01C)))
#define VICSoftIntClr   VICSoftIntClear
#define VICProtection   (*(REG32 (0xFFFFF020)))
//#define VICVectAddr     (*(REG32 (0xFFFFF030)))
#define VICVectAddr     (*(REG32 (0xFFFFFF00)))
//#define VICDefVectAddr  (*(REG32 (0xFFFFF034)))
#define VICSWPrioMask   (*(REG32 (0xFFFFF024))) // 23xx

#define VICVectAddr0    (*(REG32 (0xFFFFF100)))
#define VICVectAddr1    (*(REG32 (0xFFFFF104)))
#define VICVectAddr2    (*(REG32 (0xFFFFF108)))
#define VICVectAddr3    (*(REG32 (0xFFFFF10C)))
#define VICVectAddr4    (*(REG32 (0xFFFFF110)))
#define VICVectAddr5    (*(REG32 (0xFFFFF114)))
#define VICVectAddr6    (*(REG32 (0xFFFFF118)))
#define VICVectAddr7    (*(REG32 (0xFFFFF11C)))
#define VICVectAddr8    (*(REG32 (0xFFFFF120)))
#define VICVectAddr9    (*(REG32 (0xFFFFF124)))
#define VICVectAddr10   (*(REG32 (0xFFFFF128)))
#define VICVectAddr11   (*(REG32 (0xFFFFF12C)))
#define VICVectAddr12   (*(REG32 (0xFFFFF130)))
#define VICVectAddr13   (*(REG32 (0xFFFFF134)))
#define VICVectAddr14   (*(REG32 (0xFFFFF138)))
#define VICVectAddr15   (*(REG32 (0xFFFFF13C)))
#define VICVectAddr16   (*(REG32 (0xFFFFF140))) // 23xx from here down
#define VICVectAddr17   (*(REG32 (0xFFFFF144)))
#define VICVectAddr18   (*(REG32 (0xFFFFF148)))
#define VICVectAddr19   (*(REG32 (0xFFFFF14C)))
#define VICVectAddr20   (*(REG32 (0xFFFFF150)))
#define VICVectAddr21   (*(REG32 (0xFFFFF154)))
#define VICVectAddr22   (*(REG32 (0xFFFFF158)))
#define VICVectAddr23   (*(REG32 (0xFFFFF15C)))
#define VICVectAddr24   (*(REG32 (0xFFFFF160)))
#define VICVectAddr25   (*(REG32 (0xFFFFF164)))
#define VICVectAddr26   (*(REG32 (0xFFFFF168)))
#define VICVectAddr27   (*(REG32 (0xFFFFF16C)))
#define VICVectAddr28   (*(REG32 (0xFFFFF170)))
#define VICVectAddr29   (*(REG32 (0xFFFFF174)))
#define VICVectAddr30   (*(REG32 (0xFFFFF178)))
#define VICVectAddr31   (*(REG32 (0xFFFFF17C)))

#define VICVectCntl0    (*(REG32 (0xFFFFF200)))
#define VICVectCntl1    (*(REG32 (0xFFFFF204)))
#define VICVectCntl2    (*(REG32 (0xFFFFF208)))
#define VICVectCntl3    (*(REG32 (0xFFFFF20C)))
#define VICVectCntl4    (*(REG32 (0xFFFFF210)))
#define VICVectCntl5    (*(REG32 (0xFFFFF214)))
#define VICVectCntl6    (*(REG32 (0xFFFFF218)))
#define VICVectCntl7    (*(REG32 (0xFFFFF21C)))
#define VICVectCntl8    (*(REG32 (0xFFFFF220)))
#define VICVectCntl9    (*(REG32 (0xFFFFF224)))
#define VICVectCntl10   (*(REG32 (0xFFFFF228)))
#define VICVectCntl11   (*(REG32 (0xFFFFF22C)))
#define VICVectCntl12   (*(REG32 (0xFFFFF230)))
#define VICVectCntl13   (*(REG32 (0xFFFFF234)))
#define VICVectCntl14   (*(REG32 (0xFFFFF238)))
#define VICVectCntl15   (*(REG32 (0xFFFFF23C)))
#define VICVectCntl16   (*(REG32 (0xFFFFF240))) // 23xx from here down
#define VICVectCntl17   (*(REG32 (0xFFFFF244)))
#define VICVectCntl18   (*(REG32 (0xFFFFF248)))
#define VICVectCntl19   (*(REG32 (0xFFFFF24C)))
#define VICVectCntl20   (*(REG32 (0xFFFFF250)))
#define VICVectCntl21   (*(REG32 (0xFFFFF254)))
#define VICVectCntl22   (*(REG32 (0xFFFFF258)))
#define VICVectCntl23   (*(REG32 (0xFFFFF25C)))
#define VICVectCntl24   (*(REG32 (0xFFFFF260)))
#define VICVectCntl25   (*(REG32 (0xFFFFF264)))
#define VICVectCntl26   (*(REG32 (0xFFFFF268)))
#define VICVectCntl27   (*(REG32 (0xFFFFF26C)))
#define VICVectCntl28   (*(REG32 (0xFFFFF270)))
#define VICVectCntl29   (*(REG32 (0xFFFFF274)))
#define VICVectCntl30   (*(REG32 (0xFFFFF278)))
#define VICVectCntl31   (*(REG32 (0xFFFFF27C)))

// VIC test registers
#define VICITCR         (*(REG32 (0xFFFFF300)))
#define VICITIP1        (*(REG32 (0xFFFFF304)))
#define VICITIP2        (*(REG32 (0xFFFFF308)))
#define VICITOP1        (*(REG32 (0xFFFFF30C)))
#define VICITOP2        (*(REG32 (0xFFFFF310)))

// VIC peripheral identification registers
#define VICPeriphID0    (*(REG32 (0xFFFFFFE0)))
#define VICPeriphID1    (*(REG32 (0xFFFFFFE4)))
#define VICPeriphID2    (*(REG32 (0xFFFFFFE8)))
#define VICPeriphID3    (*(REG32 (0xFFFFFFEC)))

/*##############################################################################
## PCB - Pin Connect Block
##############################################################################*/

#define PCB_PINSEL0     (*(REG32 (0xE002C000)))
#define PCB_PINSEL1     (*(REG32 (0xE002C004)))
// #define PCB_PINSEL2     (*(REG32 (0xE002C014))) // << LPC2148
#define PCB_PINSEL2     (*(REG32 (0xE002C008)))
#define PCB_PINSEL3     (*(REG32 (0xE002C00C))) // 23xx from here down
#define PCB_PINSEL4     (*(REG32 (0xE002C010)))
#define PCB_PINSEL5     (*(REG32 (0xE002C014)))
#define PCB_PINSEL6     (*(REG32 (0xE002C018)))
#define PCB_PINSEL7     (*(REG32 (0xE002C01C)))
#define PCB_PINSEL8     (*(REG32 (0xE002C020)))
#define PCB_PINSEL9     (*(REG32 (0xE002C024)))
#define PCB_PINSEL10    (*(REG32 (0xE002C028)))

			
#define PINSEL0         PCB_PINSEL0
#define PINSEL1         PCB_PINSEL1
#define PINSEL2         PCB_PINSEL2
#define PINSEL3         PCB_PINSEL3
#define PINSEL4         PCB_PINSEL4
#define PINSEL5         PCB_PINSEL5
#define PINSEL6         PCB_PINSEL6
#define PINSEL7         PCB_PINSEL7
#define PINSEL8         PCB_PINSEL8
#define PINSEL9         PCB_PINSEL9
#define PINSEL10        PCB_PINSEL10

