tonyao-/coreipm/coreipm/lpc23nn.h
// 23xx specific: PCB_PINMODE
#define PCB_PINMODE0    (*(REG32 (0xE002C040)))
#define PCB_PINMODE1    (*(REG32 (0xE002C044)))
#define PCB_PINMODE2    (*(REG32 (0xE002C048)))
#define PCB_PINMODE3    (*(REG32 (0xE002C04C)))
#define PCB_PINMODE4    (*(REG32 (0xE002C050)))
#define PCB_PINMODE5    (*(REG32 (0xE002C054)))
#define PCB_PINMODE6    (*(REG32 (0xE002C058)))
#define PCB_PINMODE7    (*(REG32 (0xE002C05C)))
#define PCB_PINMODE8    (*(REG32 (0xE002C060)))
#define PCB_PINMODE9    (*(REG32 (0xE002C064)))

#define PINMODE0        PCB_PINMODE0
#define PINMODE1        PCB_PINMODE1
#define PINMODE2        PCB_PINMODE2
#define PINMODE3        PCB_PINMODE3
#define PINMODE4        PCB_PINMODE4
#define PINMODE5        PCB_PINMODE5
#define PINMODE6        PCB_PINMODE6
#define PINMODE7        PCB_PINMODE7
#define PINMODE8        PCB_PINMODE8
#define PINMODE9        PCB_PINMODE9


/*##############################################################################
## GPIO - General Purpose I/O
##############################################################################*/

#define GPIO_IOPIN      (*(REG32 (0xE0028000))) /* ALTERNATE NAME GPIO = GPIO0 */
#define GPIO_IOSET      (*(REG32 (0xE0028004)))
#define GPIO_IODIR      (*(REG32 (0xE0028008)))
#define GPIO_IOCLR      (*(REG32 (0xE002800C)))

#define GPIO0_IOPIN     (*(REG32 (0xE0028000))) /* ALTERNATE NAME GPIO = GPIO0 */
#define GPIO0_IOSET     (*(REG32 (0xE0028004)))
#define GPIO0_IODIR     (*(REG32 (0xE0028008)))
#define GPIO0_IOCLR     (*(REG32 (0xE002800C)))

#define IOPIN0          (*(REG32 (0xE0028000)))
#define IOSET0          (*(REG32 (0xE0028004)))
#define IODIR0          (*(REG32 (0xE0028008)))
#define IOCLR0          (*(REG32 (0xE002800C)))
#define IOPIN1          (*(REG32 (0xE0028010)))
#define IOSET1          (*(REG32 (0xE0028014)))
#define IODIR1          (*(REG32 (0xE0028018)))
#define IOCLR1          (*(REG32 (0xE002801C)))

#define IO0PIN          (*(REG32 (0xE0028000)))
#define IO0SET          (*(REG32 (0xE0028004)))
#define IO0DIR          (*(REG32 (0xE0028008)))
#define IO0CLR          (*(REG32 (0xE002800C)))
#define IO1PIN          (*(REG32 (0xE0028010)))
#define IO1SET          (*(REG32 (0xE0028014)))
#define IO1DIR          (*(REG32 (0xE0028018)))
#define IO1CLR          (*(REG32 (0xE002801C)))

/* 23xx specific: GPIO Interrupt Registers */
#define IO0_INT_EN_R    (*(REG32 (0xE0028090)))
#define IO0_INT_EN_F    (*(REG32 (0xE0028094)))
#define IO0_INT_STAT_R  (*(REG32 (0xE0028084)))
#define IO0_INT_STAT_F  (*(REG32 (0xE0028088)))
#define IO0_INT_CLR     (*(REG32 (0xE002808C)))

#define IO2_INT_EN_R    (*(REG32 (0xE00280B0)))
#define IO2_INT_EN_F    (*(REG32 (0xE00280B4)))
#define IO2_INT_STAT_R  (*(REG32 (0xE00280A4)))
#define IO2_INT_STAT_F  (*(REG32 (0xE00280A8)))
#define IO2_INT_CLR     (*(REG32 (0xE00280AC)))

#define IO_INT_STAT     (*(REG32 (0xE0028080)))

// 23xx specific: PARTCFG
#define PARTCFG         (*(REG32 (0x3FFF8000))) 


// Fast IO
#define FIO0DIR         (*(REG32 (0x3FFFC000)))
#define FIO0MASK        (*(REG32 (0x3FFFC010)))
#define FIO0PIN         (*(REG32 (0x3FFFC014)))
#define FIO0SET         (*(REG32 (0x3FFFC018)))
#define FIO0CLR         (*(REG32 (0x3FFFC01C)))

#define FIO1DIR         (*(REG32 (0x3FFFC020)))
#define FIO1MASK        (*(REG32 (0x3FFFC030)))
#define FIO1PIN         (*(REG32 (0x3FFFC034)))
#define FIO1SET         (*(REG32 (0x3FFFC038)))
#define FIO1CLR         (*(REG32 (0x3FFFC03C)))

// 23xx specific: FIO2,3,4
#define FIO2DIR         (*(REG32 (0x3FFFC040)))
#define FIO2MASK        (*(REG32 (0x3FFFC050)))
#define FIO2PIN         (*(REG32 (0x3FFFC054)))
#define FIO2SET         (*(REG32 (0x3FFFC058)))
#define FIO2CLR         (*(REG32 (0x3FFFC05C)))

#define FIO3DIR         (*(REG32 (0x3FFFC060)))
#define FIO3MASK        (*(REG32 (0x3FFFC070)))
#define FIO3PIN         (*(REG32 (0x3FFFC074)))
#define FIO3SET         (*(REG32 (0x3FFFC078)))
#define FIO3CLR         (*(REG32 (0x3FFFC07C)))

#define FIO4DIR         (*(REG32 (0x3FFFC080)))
#define FIO4MASK        (*(REG32 (0x3FFFC090)))
#define FIO4PIN         (*(REG32 (0x3FFFC094)))
#define FIO4SET         (*(REG32 (0x3FFFC098)))
#define FIO4CLR         (*(REG32 (0x3FFFC09C)))

// Memory Acceleration Module (MAM) Registers
#define MAMCR           (*(REG32 (0xE01FC000)))
#define MAMTIM          (*(REG32 (0xE01FC004)))
#define MEMMAP          (*(REG32 (0xE01FC040)))

/*##############################################################################
## UART0 / UART1
##############################################################################*/

/* ---- UART 0 --------------------------------------------- */
#define UART0_RBR       (*(REG32 (0xE000C000)))
#define UART0_THR       (*(REG32 (0xE000C000)))
#define UART0_IER       (*(REG32 (0xE000C004)))
#define UART0_IIR       (*(REG32 (0xE000C008)))
#define UART0_FCR       (*(REG32 (0xE000C008)))
#define UART0_LCR       (*(REG32 (0xE000C00C)))
#define UART0_MCR       (*(REG32 (0xE000C010)))
#define UART0_LSR       (*(REG32 (0xE000C014)))
#define UART0_MSR       (*(REG32 (0xE000C018)))
#define UART0_SCR       (*(REG32 (0xE000C01C)))
#define UART0_DLL       (*(REG32 (0xE000C000)))
#define UART0_DLM       (*(REG32 (0xE000C004)))
#define UART0_ACR       (*(REG32 (0xE000C020)))
#define UART0_FDR       (*(REG32 (0xE000C028)))
#define UART0_TER       (*(REG32 (0xE000C030)))

/* ---- UART 1 --------------------------------------------- */
#define UART1_RBR       (*(REG32 (0xE0010000)))
#define UART1_THR       (*(REG32 (0xE0010000)))
#define UART1_IER       (*(REG32 (0xE0010004)))
#define UART1_IIR       (*(REG32 (0xE0010008)))
#define UART1_FCR       (*(REG32 (0xE0010008)))
#define UART1_LCR       (*(REG32 (0xE001000C)))
#define UART1_MCR       (*(REG32 (0xE0010010)))
#define UART1_LSR       (*(REG32 (0xE0010014)))
#define UART1_MSR       (*(REG32 (0xE0010018)))
#define UART1_SCR       (*(REG32 (0xE001001C)))
#define UART1_DLL       (*(REG32 (0xE0010000)))
#define UART1_DLM       (*(REG32 (0xE0010004)))
#define UART1_ACR       (*(REG32 (0xE0010020)))
#define UART1_FDR       (*(REG32 (0xE0010028)))
#define UART1_TER       (*(REG32 (0xE0010030)))


/* Universal Asynchronous Receiver Transmitter 0 (UART0) */
#define U0RBR           UART0_RBR
#define U0THR           UART0_THR
#define U0IER           UART0_IER
#define U0IIR           UART0_IIR
#define U0FCR           UART0_FCR
#define U0LCR           UART0_LCR
#define U0MCR           UART0_MCR
#define U0LSR           UART0_LSR
#define U0MSR           UART0_MSR
#define U0SCR           UART0_SCR
#define U0DLL           UART0_DLL
#define U0DLM           UART0_DLM
#define U0ACR           UART0_ACR
#define U0FDR           UART0_FDR
#define U0TER           UART0_TER

/* Universal Asynchronous Receiver Transmitter 1 (UART1) */
#define U1RBR           UART1_RBR
#define U1THR           UART1_THR
#define U1IER           UART1_IER
#define U1IIR           UART1_IIR
#define U1FCR           UART1_FCR
#define U1LCR           UART1_LCR
#define U1MCR           UART1_MCR
#define U1LSR           UART1_LSR
#define U1MSR           UART1_MSR
#define U1SCR           UART1_SCR
#define U1DLL           UART1_DLL
#define U1DLM           UART1_DLM
#define U1ACR           UART1_ACR
#define U1FDR           UART1_FDR
#define U1TER           UART1_TER

/* Universal Asynchronous Receiver Transmitter 2 (UART2) - 23xx specific - */
#define UART2_RBR       (*(REG32 (0xE0078000)))
#define UART2_THR       (*(REG32 (0xE0078000)))
#define UART2_DLL       (*(REG32 (0xE0078000)))
#define UART2_DLM       (*(REG32 (0xE0078004)))
#define UART2_IER       (*(REG32 (0xE0078004)))
#define UART2_IIR       (*(REG32 (0xE0078008)))
#define UART2_FCR       (*(REG32 (0xE0078008)))
#define UART2_LCR       (*(REG32 (0xE007800C)))
#define UART2_LSR       (*(REG32 (0xE0078014)))
#define UART2_SCR       (*(REG32 (0xE007801C)))
#define UART2_ACR       (*(REG32 (0xE0078020)))
#define UART2_ICR       (*(REG32 (0xE0078024)))
#define UART2_FDR       (*(REG32 (0xE0078028)))
#define UART2_TER       (*(REG32 (0xE0078030)))

#define U2RBR           UART2_RBR
#define U2THR           UART2_THR
#define U2DLL           UART2_DLL
#define U2DLM           UART2_DLM
#define U2IER           UART2_IER
#define U2IIR           UART2_IIR
#define U2FCR           UART2_FCR
#define U2LCR           UART2_LCR
#define U2LSR           UART2_LSR
#define U2SCR           UART2_SCR
#define U2ACR           UART2_ACR
#define U2ICR           UART2_ICR
#define U2FDR           UART2_FDR
#define U2TER           UART2_TER

/* Universal Asynchronous Receiver Transmitter 3 (UART3) - 23xx specific - */
#define UART3_RBR       (*(REG32 (0xE007C000)))
#define UART3_THR       (*(REG32 (0xE007C000)))
#define UART3_DLL       (*(REG32 (0xE007C000)))
#define UART3_DLM       (*(REG32 (0xE007C004)))
#define UART3_IER       (*(REG32 (0xE007C004)))
#define UART3_IIR       (*(REG32 (0xE007C008)))
#define UART3_FCR       (*(REG32 (0xE007C008)))
#define UART3_LCR       (*(REG32 (0xE007C00C)))
#define UART3_LSR       (*(REG32 (0xE007C014)))
#define UART3_SCR       (*(REG32 (0xE007C01C)))
#define UART3_ACR       (*(REG32 (0xE007C020)))
#define UART3_ICR       (*(REG32 (0xE007C024)))
#define UART3_FDR       (*(REG32 (0xE007C028)))
#define UART3_TER       (*(REG32 (0xE007C030)))

#define U3RBR           UART3_RBR 
#define U3THR           UART3_THR
#define U3DLL           UART3_DLL
#define U3DLM           UART3_DLM
#define U3IER           UART3_IER
#define U3IIR           UART3_IIR
#define U3FCR           UART3_FCR
#define U3LCR           UART3_LCR
#define U3LSR           UART3_LSR
#define U3SCR           UART3_SCR
#define U3ACR           UART3_ACR
#define U3ICR           UART3_ICR
#define U3FDR           UART3_FDR
#define U3TER           UART3_TER


