tonyao-/coreipm/coreipm/lpc23nn.h
/*##############################################################################
## I2C
##############################################################################*/

#define I2C_I2CONSET    (*(REG32 (0xE001C000)))
#define I2C_I2STAT      (*(REG32 (0xE001C004)))
#define I2C_I2DAT       (*(REG32 (0xE001C008)))
#define I2C_I2ADR       (*(REG32 (0xE001C00C)))
#define I2C_I2SCLH      (*(REG32 (0xE001C010)))
#define I2C_I2SCLL      (*(REG32 (0xE001C014)))
#define I2C_I2CONCLR    (*(REG32 (0xE001C018)))

#define I2C0_I2CONSET    I2C_I2CONSET
#define I2C0_I2STAT      I2C_I2STAT
#define I2C0_I2DAT       I2C_I2DAT
#define I2C0_I2ADR       I2C_I2ADR
#define I2C0_I2SCLH      I2C_I2SCLH
#define I2C0_I2SCLL      I2C_I2SCLL
#define I2C0_I2CONCLR    I2C_I2CONCLR

#define I2C1_I2CONSET    (*(REG32 (0xE005C000)))
#define I2C1_I2STAT      (*(REG32 (0xE005C004)))
#define I2C1_I2DAT       (*(REG32 (0xE005C008)))
#define I2C1_I2ADR       (*(REG32 (0xE005C00C)))
#define I2C1_I2SCLH      (*(REG32 (0xE005C010)))
#define I2C1_I2SCLL      (*(REG32 (0xE005C014)))
#define I2C1_I2CONCLR    (*(REG32 (0xE005C018)))

/* I2C Interface 0 */
#define I2C0CONSET      I2C_I2CONSET
#define I2C0STAT        I2C_I2STAT
#define I2C0DAT         I2C_I2DAT
#define I2C0ADR         I2C_I2ADR
#define I2C0SCLH        I2C_I2SCLH
#define I2C0SCLL        I2C_I2SCLL
#define I2C0CONCLR      I2C_I2CONCLR

/* I2C Interface 1 */
#define I2C1CONSET      I2C1_I2CONSET
#define I2C1STAT        I2C1_I2STAT
#define I2C1DAT         I2C1_I2DAT
#define I2C1ADR         I2C1_I2ADR
#define I2C1SCLH        I2C1_I2SCLH
#define I2C1SCLL        I2C1_I2SCLL
#define I2C1CONCLR      I2C1_I2CONCLR

/* I2C Interface 2 */
#define I2C2_I2CONSET   (*(REG32 (0xE0080000)))
#define I2C2_I2STAT     (*(REG32 (0xE0080004)))
#define I2C2_I2DAT      (*(REG32 (0xE0080008)))
#define I2C2_I2ADR      (*(REG32 (0xE008000C)))
#define I2C2_I2SCLH     (*(REG32 (0xE0080010)))
#define I2C2_I2SCLL     (*(REG32 (0xE0080014)))
#define I2C2_I2CONCLR   (*(REG32 (0xE0080018)))

#define I22CONSET       I2C2_I2CONSET
#define I22STAT         I2C2_I2STAT
#define I22DAT          I2C2_I2DAT
#define I22ADR          I2C2_I2ADR
#define I22SCLH         I2C2_I2SCLH
#define I22SCLL         I2C2_I2SCLL
#define I22CONCLR       I2C2_I2CONCLR

/*##############################################################################
## SPI - Serial Peripheral Interface
##############################################################################*/

/* SPI0 (Serial Peripheral Interface 0) */
#define SPI_SPCR        (*(REG32 (0xE0020000)))
#define SPI_SPSR        (*(REG32 (0xE0020004)))
#define SPI_SPDR        (*(REG32 (0xE0020008)))
#define SPI_SPCCR       (*(REG32 (0xE002000C)))
#define SPI_SPTCR       (*(REG32 (0xE0020010)))
#define SPI_SPTSR       (*(REG32 (0xE0020014)))
#define SPI_SPTOR       (*(REG32 (0xE0020018)))
#define SPI_SPINT       (*(REG32 (0xE002001C)))

#define S0SPCR          SPI_SPCR	// SPI0 Control Register
#define S0SPSR          SPI_SPSR	// SPI0 Status Register
#define S0SPDR          SPI_SPDR	// SPI Data Register
#define S0SPCCR         SPI_SPCCR	// SPI Clock Counter Register
#define S0SPTCR         SPI_SPTCR
#define S0SPTSR         SPI_SPTSR
#define S0SPTOR         SPI_SPTOR
#define S0SPINT         SPI_SPINT	// SPI Interrupt Flag

/* SSP Controller (SPI1) */
#define SSPCR0          (*(REG32 (0xE0068000)))	// Control Register 0
#define SSPCR1          (*(REG32 (0xE0068004)))	// Control Register 1
#define SSPDR           (*(REG32 (0xE0068008)))	// Data Register
#define SSPSR           (*(REG32 (0xE006800C)))	// Status Register
#define SSPCPSR         (*(REG32 (0xE0068010)))	// Clock Prescale Register
#define SSPIMSC         (*(REG32 (0xE0068014)))	// Interrupt Mask Set and Clear Register
#define SSPRIS          (*(REG32 (0xE0068018)))	// Raw Interrupt Status Register
#define SSPMIS          (*(REG32 (0xE006801C)))	// Masked Interrupt Status Register
#define SSPICR          (*(REG32 (0xE0068020)))	// SSPICR Interrupt Clear Register

/*##############################################################################
## Timer 0 and Timer 1
##############################################################################*/

/* ---- Timer 0 -------------------------------------------- */
#define T0_IR           (*(REG32 (0xE0004000)))
#define T0_TCR          (*(REG32 (0xE0004004)))
#define T0_TC           (*(REG32 (0xE0004008)))
#define T0_PR           (*(REG32 (0xE000400C)))
#define T0_PC           (*(REG32 (0xE0004010)))
#define T0_MCR          (*(REG32 (0xE0004014)))
#define T0_MR0          (*(REG32 (0xE0004018)))
#define T0_MR1          (*(REG32 (0xE000401C)))
#define T0_MR2          (*(REG32 (0xE0004020)))
#define T0_MR3          (*(REG32 (0xE0004024)))
#define T0_CCR          (*(REG32 (0xE0004028)))
#define T0_CR0          (*(REG32 (0xE000402C)))
#define T0_CR1          (*(REG32 (0xE0004030)))
#define T0_CR2          (*(REG32 (0xE0004034)))
#define T0_CR3          (*(REG32 (0xE0004038)))
#define T0_EMR          (*(REG32 (0xE000403C)))
#define T0_CTCR         (*(REG32 (0xE0004070)))

#define T0IR            T0_IR
#define T0TCR           T0_TCR
#define T0TC            T0_TC
#define T0PR            T0_PR
#define T0PC            T0_PC
#define T0MCR           T0_MCR
#define T0MR0           T0_MR0
#define T0MR1           T0_MR1
#define T0MR2           T0_MR2
#define T0MR3           T0_MR3
#define T0CCR           T0_CCR
#define T0CR0           T0_CR0
#define T0CR1           T0_CR1
#define T0CR2           T0_CR2
#define T0CR3           T0_CR3
#define T0EMR           T0_EMR
#define T0CTCR          T0_CTCR

/* ---- Timer 1 -------------------------------------------- */
#define T1_IR           (*(REG32 (0xE0008000)))
#define T1_TCR          (*(REG32 (0xE0008004)))
#define T1_TC           (*(REG32 (0xE0008008)))
#define T1_PR           (*(REG32 (0xE000800C)))
#define T1_PC           (*(REG32 (0xE0008010)))
#define T1_MCR          (*(REG32 (0xE0008014)))
#define T1_MR0          (*(REG32 (0xE0008018)))
#define T1_MR1          (*(REG32 (0xE000801C)))
#define T1_MR2          (*(REG32 (0xE0008020)))
#define T1_MR3          (*(REG32 (0xE0008024)))
#define T1_CCR          (*(REG32 (0xE0008028)))
#define T1_CR0          (*(REG32 (0xE000802C)))
#define T1_CR1          (*(REG32 (0xE0008030)))
#define T1_CR2          (*(REG32 (0xE0008034)))
#define T1_CR3          (*(REG32 (0xE0008038)))
#define T1_EMR          (*(REG32 (0xE000803C)))
#define T1_CTCR         (*(REG32 (0xE0008070)))

#define T1IR            T1_IR
#define T1TCR           T1_TCR
#define T1TC            T1_TC
#define T1PR            T1_PR
#define T1PC            T1_PC
#define T1MCR           T1_MCR
#define T1MR0           T1_MR0
#define T1MR1           T1_MR1
#define T1MR2           T1_MR2
#define T1MR3           T1_MR3
#define T1CCR           T1_CCR
#define T1CR0           T1_CR0
#define T1CR1           T1_CR1
#define T1CR2           T1_CR2
#define T1CR3           T1_CR3
#define T1EMR           T1_EMR
#define T1CTCR          T1_CTCR

