tonyao-/coreipm/coreipm/lpc23nn.h
/* ---- Timer 2 ------- 23xx specific ----------------------------- */
#define T2_IR           (*(REG32 (0xE0070000)))
#define T2_TCR          (*(REG32 (0xE0070004)))
#define T2_TC           (*(REG32 (0xE0070008)))
#define T2_PR           (*(REG32 (0xE007000C)))
#define T2_PC           (*(REG32 (0xE0070010)))
#define T2_MCR          (*(REG32 (0xE0070014)))
#define T2_MR0          (*(REG32 (0xE0070018)))
#define T2_MR1          (*(REG32 (0xE007001C)))
#define T2_MR2          (*(REG32 (0xE0070020)))
#define T2_MR3          (*(REG32 (0xE0070024)))
#define T2_CCR          (*(REG32 (0xE0070028)))
#define T2_CR0          (*(REG32 (0xE007002C)))
#define T2_CR1          (*(REG32 (0xE0070030)))
#define T2_CR2          (*(REG32 (0xE0070034)))
#define T2_CR3          (*(REG32 (0xE0070038)))
#define T2_EMR          (*(REG32 (0xE007003C)))
#define T2_CTCR         (*(REG32 (0xE0070070)))

#define T2IR            T2_IR
#define T2TCR           T2_TCR
#define T2TC            T2_TC
#define T2PR            T2_PR
#define T2PC            T2_PC
#define T2MCR           T2_MCR
#define T2MR0           T2_MR0
#define T2MR1           T2_MR1
#define T2MR2           T2_MR2
#define T2MR3           T2_MR3
#define T2CCR           T2_CCR
#define T2CR0           T2_CR0
#define T2CR1           T2_CR1
#define T2CR2           T2_CR2
#define T2CR3           T2_CR3
#define T2EMR           T2_EMR
#define T2CTCR          T2_CTCR

/* ---- Timer 3 ------- 23xx specific ----------------------------- */
#define T3_IR           (*(REG32 (0xE0074000)))
#define T3_TCR          (*(REG32 (0xE0074004)))
#define T3_TC           (*(REG32 (0xE0074008)))
#define T3_PR           (*(REG32 (0xE007400C)))
#define T3_PC           (*(REG32 (0xE0074010)))
#define T3_MCR          (*(REG32 (0xE0074014)))
#define T3_MR0          (*(REG32 (0xE0074018)))
#define T3_MR1          (*(REG32 (0xE007401C)))
#define T3_MR2          (*(REG32 (0xE0074020)))
#define T3_MR3          (*(REG32 (0xE0074024)))
#define T3_CCR          (*(REG32 (0xE0074028)))
#define T3_CR0          (*(REG32 (0xE007402C)))
#define T3_CR1          (*(REG32 (0xE0074030)))
#define T3_CR2          (*(REG32 (0xE0074034)))
#define T3_CR3          (*(REG32 (0xE0074038)))
#define T3_EMR          (*(REG32 (0xE007403C)))
#define T3_CTCR         (*(REG32 (0xE0074070)))

#define T3IR            T3_IR 
#define T3TCR           T3_TCR 
#define T3TC            T3_TC 
#define T3PR            T3_PR 
#define T3PC            T3_PC 
#define T3MCR           T3_MCR 
#define T3MR0           T3_MR0 
#define T3MR1           T3_MR1 
#define T3MR2           T3_MR2 
#define T3MR3           T3_MR3 
#define T3CCR           T3_CCR 
#define T3CR0           T3_CR0 
#define T3CR1           T3_CR1 
#define T3CR2           T3_CR2 
#define T3CR3           T3_CR3 
#define T3EMR           T3_EMR 
#define T3CTCR          T3_CTCR 

/*##############################################################################
## PWM
##############################################################################*/
// PWM0
#define PWM_IR          (*(REG32 (0xE0014000)))
#define PWM_TCR         (*(REG32 (0xE0014004)))
#define PWM_TC          (*(REG32 (0xE0014008)))
#define PWM_PR          (*(REG32 (0xE001400C)))
#define PWM_PC          (*(REG32 (0xE0014010)))
#define PWM_MCR         (*(REG32 (0xE0014014)))
#define PWM_MR0         (*(REG32 (0xE0014018)))
#define PWM_MR1         (*(REG32 (0xE001401C)))
#define PWM_MR2         (*(REG32 (0xE0014020)))
#define PWM_MR3         (*(REG32 (0xE0014024)))
#define PWM_MR4         (*(REG32 (0xE0014040)))
#define PWM_MR5         (*(REG32 (0xE0014044)))
#define PWM_MR6         (*(REG32 (0xE0014048)))
#define PWM_EMR         (*(REG32 (0xE001403C)))
#define PWM_PCR         (*(REG32 (0xE001404C)))
#define PWM_LER         (*(REG32 (0xE0014050)))

#define PWM_CCR         (*(REG32 (0xE0014028)))
#define PWM_CR0         (*(REG32 (0xE001402C)))
#define PWM_CR1         (*(REG32 (0xE0014030)))
#define PWM_CR2         (*(REG32 (0xE0014034)))
#define PWM_CR3         (*(REG32 (0xE0014038)))
#define PWM_CTCR        (*(REG32 (0xE0014070)))

#define PWMIR           PWM_IR
#define PWMTCR          PWM_TCR
#define PWMTC           PWM_TC
#define PWMPR           PWM_PR
#define PWMPC           PWM_PC
#define PWMMCR          PWM_MCR
#define PWMMR0          PWM_MR0
#define PWMMR1          PWM_MR1
#define PWMMR2          PWM_MR2
#define PWMMR3          PWM_MR3
#define PWMMR4          PWM_MR4
#define PWMMR5          PWM_MR5
#define PWMMR6          PWM_MR6
#define PWMPCR          PWM_PCR
#define PWMLER          PWM_LER

#define PWM0_IR         PWM_IR
#define PWM0_TCR        PWM_CTR
#define PWM0_TC         PWM_TC
#define PWM0_PR         PWM_PR
#define PWM0_PC         PWM_PC
#define PWM0_MCR        PWM_MCR
#define PWM0_MR0        PWM_MR0
#define PWM0_MR1        PWM_MR1
#define PWM0_MR2        PWM_MR2
#define PWM0_MR3        PWM_MR3
#define PWM0_CCR        PWM_CCR
#define PWM0_CR0        PWM_CR0
#define PWM0_CR1        PWM_CR1
#define PWM0_CR2        PWM_CR2
#define PWM0_CR3        PWM_CR3
#define PWM0_EMR        PWM_EMR
#define PWM0_MR4        PWM_MR4
#define PWM0_MR5        PWM_MR5
#define PWM0_MR6        PWM_MR6
#define PWM0_PCR        PWM_PCR
#define PWM0_LER        PWM_LER
#define PWM0_CTCR       PWM_CTCR

#define PWM0IR          PWM_IR
#define PWM0TCR         PWM_CTR
#define PWM0TC          PWM_TC
#define PWM0PR          PWM_PR
#define PWM0PC          PWM_PC
#define PWM0MCR         PWM_MCR
#define PWM0MR0         PWM_MR0
#define PWM0MR1         PWM_MR1
#define PWM0MR2         PWM_MR2
#define PWM0MR3         PWM_MR3
#define PWM0CCR         PWM_CCR
#define PWM0CR0         PWM_CR0
#define PWM0CR1         PWM_CR1
#define PWM0CR2         PWM_CR2
#define PWM0CR3         PWM_CR3
#define PWM0EMR         PWM_EMR
#define PWM0MR4         PWM_MR4
#define PWM0MR5         PWM_MR5
#define PWM0MR6         PWM_MR6
#define PWM0PCR         PWM_PCR
#define PWM0LER         PWM_LER
#define PWM0CTCR        PWM_CTCR

