tonyao-/coreipm/coreipm/lpc23nn.h
// PWM1  23xx specific 
#define PWM1_BASE_ADDR		0xE0018000
#define PWM1_IR         (*(REG32 (0xE0018000)))
#define PWM1_TCR        (*(REG32 (0xE0018004)))
#define PWM1_TC         (*(REG32 (0xE0018008)))
#define PWM1_PR         (*(REG32 (0xE001800C)))
#define PWM1_PC         (*(REG32 (0xE0018010)))
#define PWM1_MCR        (*(REG32 (0xE0018014)))
#define PWM1_MR0        (*(REG32 (0xE0018018)))
#define PWM1_MR1        (*(REG32 (0xE001801C)))
#define PWM1_MR2        (*(REG32 (0xE0018020)))
#define PWM1_MR3        (*(REG32 (0xE0018024)))
#define PWM1_CCR        (*(REG32 (0xE0018028)))
#define PWM1_CR0        (*(REG32 (0xE001802C)))
#define PWM1_CR1        (*(REG32 (0xE0018030)))
#define PWM1_CR2        (*(REG32 (0xE0018034)))
#define PWM1_CR3        (*(REG32 (0xE0018038)))
#define PWM1_EMR        (*(REG32 (0xE001803C)))
#define PWM1_MR4        (*(REG32 (0xE0018040)))
#define PWM1_MR5        (*(REG32 (0xE0018044)))
#define PWM1_MR6        (*(REG32 (0xE0018048)))
#define PWM1_PCR        (*(REG32 (0xE001804C)))
#define PWM1_LER        (*(REG32 (0xE0018050)))
#define PWM1_CTCR       (*(REG32 (0xE0018070)))

#define PWM1IR          PWM1_IR
#define PWM1TCR         PWM1_TCR
#define PWM1TC          PWM1_TC
#define PWM1PR          PWM1_PR
#define PWM1PC          PWM1_PC
#define PWM1MCR         PWM1_MCR
#define PWM1MR0         PWM1_MR0
#define PWM1MR1         PWM1_MR1
#define PWM1MR2         PWM1_MR2
#define PWM1MR3         PWM1_MR3
#define PWM1CCR         PWM1_CCR
#define PWM1CR0         PWM1_CR0
#define PWM1CR1         PWM1_CR1
#define PWM1CR2         PWM1_CR2
#define PWM1CR3         PWM1_CR3
#define PWM1EMR         PWM1_EMR
#define PWM1MR4         PWM1_MR4
#define PWM1MR5         PWM1_MR5
#define PWM1MR6         PWM1_MR6
#define PWM1PCR         PWM1_PCR
#define PWM1LER         PWM1_LER
#define PWM1CTCR        PWM1_CTCR


/*##############################################################################
## RTC
##############################################################################*/

/* ---- RTC: Miscellaneous Register Group ------------------ */
#define RTC_ILR         (*(REG32 (0xE0024000)))
#define RTC_CTC         (*(REG32 (0xE0024004)))
#define RTC_CCR         (*(REG32 (0xE0024008)))  
#define RTC_CIIR        (*(REG32 (0xE002400C)))
#define RTC_AMR         (*(REG32 (0xE0024010)))
#define RTC_CTIME0      (*(REG32 (0xE0024014)))
#define RTC_CTIME1      (*(REG32 (0xE0024018)))
#define RTC_CTIME2      (*(REG32 (0xE002401C)))

/* ---- RTC: Timer Control Group --------------------------- */
#define RTC_SEC         (*(REG32 (0xE0024020)))
#define RTC_MIN         (*(REG32 (0xE0024024)))
#define RTC_HOUR        (*(REG32 (0xE0024028)))
#define RTC_DOM         (*(REG32 (0xE002402C)))
#define RTC_DOW         (*(REG32 (0xE0024030)))
#define RTC_DOY         (*(REG32 (0xE0024034)))
#define RTC_MONTH       (*(REG32 (0xE0024038)))
#define RTC_YEAR        (*(REG32 (0xE002403C)))

/* ---- RTC: Alarm Control Group --------------------------- */
#define RTC_ALSEC       (*(REG32 (0xE0024060)))
#define RTC_ALMIN       (*(REG32 (0xE0024064)))
#define RTC_ALHOUR      (*(REG32 (0xE0024068)))
#define RTC_ALDOM       (*(REG32 (0xE002406C)))
#define RTC_ALDOW       (*(REG32 (0xE0024070)))
#define RTC_ALDOY       (*(REG32 (0xE0024074)))
#define RTC_ALMON       (*(REG32 (0xE0024078)))
#define RTC_ALYEAR      (*(REG32 (0xE002407C)))

/* ---- RTC: Reference Clock Divider Group ----------------- */
#define RTC_PREINT      (*(REG32 (0xE0024080)))
#define RTC_PREFRAC     (*(REG32 (0xE0024084)))

/* Real Time Clock */
#define ILR             RTC_ILR
#define CTC             RTC_CTC
#define CCR             RTC_CCR
#define CIIR            RTC_CIIR
#define AMR             RTC_AMR
#define CTIME0          RTC_CTIME0
#define CTIME1          RTC_CTIME1
#define CTIME2          RTC_CTIME2

#define SEC             RTC_SEC 
#define MIN             RTC_MIN
#define HOUR            RTC_HOUR
#define DOM             RTC_DOM
#define DOW             RTC_DOW
#define DOY             RTC_DOY
#define MONTH           RTC_MONTH
#define YEAR            RTC_YEAR

#define ALSEC           RTC_ALSEC
#define ALMIN           RTC_ALMIN
#define ALHOUR          RTC_ALHOUR
#define ALDOM           RTC_ALDOM
#define ALDOW           RTC_ALDOW
#define ALDOY           RTC_ALDOY
#define ALMON           RTC_ALMON
#define ALYEAR          RTC_ALYEAR

#define PREINT          RTC_PREINT
#define PREFRAC         RTC_PREFRAC

/* A/D Converter 0 (AD0) */
#define AD0CR           (*(REG32 (0xE0034000)))
#define AD0GDR          (*(REG32 (0xE0034004)))
#define AD0STAT         (*(REG32 (0xE0034030)))
#define AD0INTEN        (*(REG32 (0xE003400C)))
#define AD0DR0          (*(REG32 (0xE0034010)))
#define AD0DR1          (*(REG32 (0xE0034014)))
#define AD0DR2          (*(REG32 (0xE0034018)))
#define AD0DR3          (*(REG32 (0xE003401C)))
#define AD0DR4          (*(REG32 (0xE0034020)))
#define AD0DR5          (*(REG32 (0xE0034024)))
#define AD0DR6          (*(REG32 (0xE0034028)))
#define AD0DR7          (*(REG32 (0xE003402C)))

/* A/D Converter 1 (AD1) */
#define AD1CR           (*(REG32 (0xE0060000)))
#define AD1GDR          (*(REG32 (0xE0060004)))
#define AD1STAT         (*(REG32 (0xE0060030)))
#define AD1INTEN        (*(REG32 (0xE006000C)))
#define AD1DR0          (*(REG32 (0xE0060010)))
#define AD1DR1          (*(REG32 (0xE0060014)))
#define AD1DR2          (*(REG32 (0xE0060018)))
#define AD1DR3          (*(REG32 (0xE006001C)))
#define AD1DR4          (*(REG32 (0xE0060020)))
#define AD1DR5          (*(REG32 (0xE0060024)))
#define AD1DR6          (*(REG32 (0xE0060028)))
#define AD1DR7          (*(REG32 (0xE006002C)))

/* A/D Converter Global */
#define ADGSR           (*(REG32 (0xE0034008)))

/* D/A Converter */
#define DACR            (*(REG32 (0xE006C000)))

/*##############################################################################
## WD - Watchdog
##############################################################################*/

#define WD_WDMOD        (*(REG32 (0xE0000000)))
#define WD_WDTC         (*(REG32 (0xE0000004)))
#define WD_WDFEED       (*(REG32 (0xE0000008)))
#define WD_WDTV         (*(REG32 (0xE000000C)))

#define WDMOD           WD_WDMOD
#define WDTC            WD_WDTC
#define WDFEED          WD_WDFEED
#define WDTV            WD_WDTV

/* USB Controller */
#define USBIntSt        (*(REG32 (0xE01FC1C0)))
#define USBDevIntSt     (*(REG32 (0xE0090000)))
#define USBDevIntEn     (*(REG32 (0xE0090004)))
#define USBDevIntClr    (*(REG32 (0xE0090008)))
#define USBDevIntSet    (*(REG32 (0xE009000C)))
#define USBDevIntPri    (*(REG32 (0xE009002C)))
#define USBEpIntSt      (*(REG32 (0xE0090030)))
#define USBEpIntEn      (*(REG32 (0xE0090034)))
#define USBEpIntClr     (*(REG32 (0xE0090038)))
#define USBEpIntSet     (*(REG32 (0xE009003C)))
#define USBEpIntPri     (*(REG32 (0xE0090040)))
#define USBReEp         (*(REG32 (0xE0090044)))
#define USBEpInd        (*(REG32 (0xE0090048)))
#define USBMaxPSize     (*(REG32 (0xE009004C)))
#define USBRxData       (*(REG32 (0xE0090018)))
#define USBRxPLen       (*(REG32 (0xE0090020)))
#define USBTxData       (*(REG32 (0xE009001C)))
#define USBTxPLen       (*(REG32 (0xE0090024)))
#define USBCtrl         (*(REG32 (0xE0090028)))
#define USBCmdCode      (*(REG32 (0xE0090010)))
#define USBCmdData      (*(REG32 (0xE0090014)))
#define USBDMARSt       (*(REG32 (0xE0090050)))
#define USBDMARClr      (*(REG32 (0xE0090054)))
#define USBDMARSet      (*(REG32 (0xE0090058)))
#define USBUDCAH        (*(REG32 (0xE0090080)))
#define USBEpDMASt      (*(REG32 (0xE0090084)))
#define USBEpDMAEn      (*(REG32 (0xE0090088)))
#define USBEpDMADis     (*(REG32 (0xE009008C)))
#define USBDMAIntSt     (*(REG32 (0xE0090090)))
#define USBDMAIntEn     (*(REG32 (0xE0090094)))
#define USBEoTIntSt     (*(REG32 (0xE00900A0)))
#define USBEoTIntClr    (*(REG32 (0xE00900A4)))
#define USBEoTIntSet    (*(REG32 (0xE00900A8)))
#define USBNDDRIntSt    (*(REG32 (0xE00900AC)))
#define USBNDDRIntClr   (*(REG32 (0xE00900B0)))
#define USBNDDRIntSet   (*(REG32 (0xE00900B4)))
#define USBSysErrIntSt  (*(REG32 (0xE00900B8)))
#define USBSysErrIntClr (*(REG32 (0xE00900BC)))
#define USBSysErrIntSet (*(REG32 (0xE00900C0)))

