tonyao-/coreipm/coreipm/lpc23nn.h
/* TODO move this to lpc23nn.h - recheck fields */
/* PINSEL2 register setting flags */

#define PS2_P1_0_GPIO 		0x00000000 // GPIO Port 1.0 [1:0] 
#define PS2_P1_0_ENET_TXD0	0x00000001 // ENET_TXD0

#define PS2_P1_1_GPIO		0x00000000 // GPIO Port 1.1 [3:2] 
#define PS2_P1_1_ENET_TXD1	0x00000004 // ENET_TXD1

#define PS2_P1_4_GPIO		0x00000000 // GPIO Port 1.4 [9:8]
#define PS2_P1_4_ENET_TX_EN	0x00000100 // ENET_TX_EN

#define PS2_P1_8_GPIO		0x00000000 // GPIO Port 1.8 [17:16]
#define PS2_P1_8_ENET_CRS	0x00010000 // ENET_CRS

#define PS2_P1_9_GPIO		0x00000000 // GPIO Port 1.9 [19:18]
#define PS2_P1_9_ENET_RXD0	0x00040000 // ENET_RXD0

#define PS2_P1_10_GPIO		0x00000000 // GPIO Port 1.10 [21:20]
#define PS2_P1_10_ENET_RXD1	0x00100000 // ENET_RXD1

#define PS2_P1_14_GPIO		0x00000000 // GPIO Port 1.14 [29:28]
#define PS2_P1_14_ENET_RX_ER	0x10000000 // ENET_RX_ER

#define PS2_P1_15_GPIO		0x00000000 // GPIO Port 1.15 [31:30]
#define PS2_P1_15_ENET_REF_CLK	0x40000000 // ENET_REF_CLK

/* PINSEL3 register setting flags */
#define PS2_P1_16_GPIO 		0x00000000 // GPIO Port 1.16 [1:0]
#define PS2_P1_16_ENET_MDC	0x00000001 // ENET_MDC

#define PS2_P1_17_GPIO 		0x00000000 // GPIO Port 1.17 [3:2]
#define PS2_P1_17_ENET_MDIO	0x00000004 // ENET_MDIO

#define PS2_P1_18_GPIO 		0x00000000 // GPIO Port 1.18 [5:4]
#define PS2_P1_18_USB_UP_LED1	0x00000010 // USB_UP_LED1[1]
#define PS2_P1_18_PWM1_1	0x00000020 // PWM1.1
#define PS2_P1_18_CAP1_0	0x00000030 // CAP1.0
/*
7:6 P1.19 GPIO Port 1.19 Reserved Reserved CAP1.1 00
9:8 P1.20 GPIO Port 1.20 Reserved PWM1.2 SCK0 00
11:10 P1.21 GPIO Port 1.21 Reserved PWM1.3 SSEL0 00
13:12 P1.22 GPIO Port 1.22 Reserved Reserved MAT1.0 00
15:14 P1.23 GPIO Port 1.23 Reserved PWM1.4 MISO0 00
17:16 P1.24 GPIO Port 1.24 Reserved PWM1.5 MOSI0 00
19:18 P1.25 GPIO Port 1.25 Reserved Reserved MAT1.1 00
21:20 P1.26 GPIO Port 1.26 Reserved PWM1.6 CAP0.0 00
23:22 P1.27 GPIO Port 1.27 Reserved Reserved CAP0.1 00
25:24 P1.28 GPIO Port 1.28 Reserved PCAP1.0 MAT0.0 00
27:26 P1.29 GPIO Port 1.29 Reserved PCAP1.1 MAT0.1 00
29:28 P1.30 GPIO Port 1.30 Reserved VBUS[1] AD0.4 00
31:30 P1.31 GPIO Port 1.31 Reserved SCK1 AD0.5 00
*/
/*
Power Control for Peripherals register (PCONP - address 0xE01F C0C4) bit
description
*/
#define PCTIM0		0x00000002 // 1 Timer/Counter 0 power/clock control bit. 1
#define PCTIM1		0x00000004 // 2 Timer/Counter 1 power/clock control bit. 1
#define PCUART0		0x00000008 // 3 UART0 power/clock control bit. 1
#define PCUART1		0x00000010 // 4 UART1 power/clock control bit. 1
#define PCPWM1		0x00000040 // 6 PWM1 power/clock control bit. 1
#define PCI2C0		0x00000080 // 7 The I2C0 interface power/clock control bit. 1
#define PCSPI		0x00000100 // 8 The SPI interface power/clock control bit. 1
#define PCRTC		0x00000200 // 9 The RTC power/clock control bit. 1
#define PCSSP1		0x00000400 // 10 The SSP1 interface power/clock control bit. 1
#define PCEMC		0x00000800 // 11 External Memory Controller 1
#define PCAD		0x00001000 // 12 A/D converter (ADC) power/clock control bit.
/* Note: Clear the PDN bit in the AD0CR (see Section 27–6.1) before
   clearing this bit, and set this bit before setting PDN.0 */

#define PCAN1		0x00002000 // 13 CAN Controller 1 power/clock control bit. 0
#define PCAN2		0x00004000 // 14 CAN Controller 2 power/clock control bit. 0
/* 18:15 - Reserved, user software should not write ones to reserved bits. The
   value read from a reserved bit is not defined. */

#define PCI2C1		0x00080000 // 19 The I2C1 interface power/clock control bit. 1
				   // 20 - Unused, always 0
#define PCSSP0		0x00200000 // 21 The SSP0 interface power/clock control bit. 1
#define PCTIM2		0x00400000 // Timer 2 power/clock control bit. 0
#define PCTIM3		0x00800000 // Timer 3 power/clock control bit. 0
#define PCUART2		0x01000000 // UART 2 power/clock control bit. 0
#define PCUART3		0x02000000 // UART 3 power/clock control bit. 0
#define PCI2C2		0x04000000 // I2C interface 2 power/clock control bit. 1
#define PCI2S		0x08000000 // I2S interface power/clock control bit. 0
#define PCSDC		0x10000000 // SD card interface power/clock control bit. 0
#define PCGPDMA		0x20000000 // GP DMA function power/clock control bit. 0
#define PCENET		0x40000000 // Ethernet block power/clock control bit. 0
#define PCUSB		0x80000000 // USB interface power/clock control bit. 0

/*
Ethernet RMII (Reduced Media Independent Interface) pin descriptions
Pin Name 	Type 	Pin Description
---------------------------------------
ENET_TX_EN 	Output 	Transmit data enable
ENET_TXD[1:0]	Output 	Transmit data, 2 bits
ENET_RXD[1:0] 	Input 	Receive data, 2 bits.
ENET_RX_ER 	Input 	Receive error.
ENET_CRS 	Input 	Carrier sense/data valid.
ENET_REF_CLK 	Input 	Reference clock

Ethernet MIIM pin descriptions
Pin Name 	Type 	Pin Description
---------------------------------------
ENET_MDC 	Output 	MIIM clock.
ENET_MDIO	Input/Output MI data input and output

*/

/* MAC registers */
#define ETH_MAC1 (*(REG32 (0xFFE00000))) // R/W MAC configuration register 1.
#define ETH_MAC2 (*(REG32 (0xFFE00004))) // R/W MAC configuration register 2.
#define ETH_IPGT (*(REG32 (0xFFE00008))) // R/W Back-to-Back Inter-Packet-Gap register.
#define ETH_IPGR (*(REG32 (0xFFE0000C))) // R/W Non Back-to-Back Inter-Packet-Gap register.
#define ETH_CLRT (*(REG32 (0xFFE00010))) // R/W Collision window / Retry register.
#define ETH_MAXF (*(REG32 (0xFFE00014))) // R/W Maximum Frame register.
#define ETH_SUPP (*(REG32 (0xFFE00018))) // R/W PHY Support register.
#define ETH_TEST (*(REG32 (0xFFE0001C))) // R/W Test register.
#define ETH_MCFG (*(REG32 (0xFFE00020))) // R/W MII Mgmt Configuration register.
#define ETH_MCMD (*(REG32 (0xFFE00024))) // R/W MII Mgmt Command register.
#define ETH_MADR (*(REG32 (0xFFE00028))) // R/W MII Mgmt Address register.
#define ETH_MWTD (*(REG32 (0xFFE0002C))) // WO MII Mgmt Write Data register.
#define ETH_MRDD (*(REG32 (0xFFE00030))) // RO MII Mgmt Read Data register.
#define ETH_MIND (*(REG32 (0xFFE00034))) // RO MII Mgmt Indicators register.

#define ETH_SA0  (*(REG32 (0xFFE00040))) // R/W Station Address 0 register.
#define ETH_SA1  (*(REG32 (0xFFE00044))) // R/W Station Address 1 register.
#define ETH_SA2  (*(REG32 (0xFFE00048))) // R/W Station Address 2 register.

