tonyao-/coreipm/coreipm/lpc23nn.h
#define MAC_MAC1 ETH_MAC1
#define MAC_MAC2 ETH_MAC2    
#define MAC_IPGT ETH_IPGT    
#define MAC_IPGR ETH_IPGR 
#define MAC_CLRT ETH_CLRT 
#define MAC_MAXF ETH_MAXF
#define MAC_SUPP ETH_SUPP 
#define MAC_TEST ETH_TEST
#define MAC_MCFG ETH_MCFG
#define MAC_MCMD ETH_MCMD
#define MAC_MADR ETH_MADR
#define MAC_MWTD ETH_MWTD
#define MAC_MRDD ETH_MRDD
#define MAC_MIND ETH_MIND

#define MAC_SA0  ETH_SA0
#define MAC_SA1  ETH_SA1
#define MAC_SA2  ETH_SA2

/* Control registers */
#define EthCommand 		0xFFE00100 // R/W Command register.
#define EthStatus 		0xFFE00104 // RO Status register.
#define EthRxDescriptor		0xFFE00108 // R/W Receive descriptor base address register.
#define EthRxStatus		0xFFE0010C // R/W Receive status base address register.
#define EthRxDescriptorNumber	0xFFE00110 // R/W Receive number of descriptors register.
#define EthRxProduceIndex	0xFFE00114 // RO Receive produce index register.
#define EthRxConsumeIndex	0xFFE00118 // R/W Receive consume index register.
#define EthTxDescriptor		0xFFE0011C // R/W Transmit descriptor base address register.
#define EthTxStatus		0xFFE00120 // R/W Transmit status base address register.
#define EthTxDescriptorNumber	0xFFE00124 // R/W Transmit number of descriptors register.
#define EthTxProduceIndex 	0xFFE00128 // R/W Transmit produce index register.
#define EthTxConsumeIndex 	0xFFE0012C // RO Transmit consume index register.
#define EthTSV0 		0xFFE00158 // RO Transmit status vector 0 register.
#define EthTSV1 		0xFFE0015C // RO Transmit status vector 1 register.
#define EthRSV 			0xFFE00160 // RO Receive status vector register.
#define EthFlowControlCounter 	0xFFE00170 // R/W Flow control counter register.
#define EthFlowControlStatus 	0xFFE00174 // RO Flow control status register.

/* Rx filter registers */
#define EthRxFliterCtrl		0xFFE00200 // Receive filter control register.
#define EthRxFilterWoLStatus	0xFFE00204 // Receive filter WoL status register.
#define EthRxFilterWoLClear 	0xFFE00208 // Receive filter WoL clear register.
#define EthHashFilterL 		0xFFE00210 // Hash filter table LSBs register.
#define EthHashFilterH 		0xFFE00214 // Hash filter table MSBs register.

/* Module control registers */
#define EthIntStatus		0xFFE00FE0 // RO Interrupt status register.
#define EthIntEnable 		0xFFE00FE4 // R/W Interrupt enable register.
#define EthIntClear 		0xFFE00FE8 // WO Interrupt clear register.
#define EthIntSet 		0xFFE00FEC // WO Interrupt set register.
#define EthPowerDown 		0xFFE00FF4 // R/W Power-down register.


#endif /* lpc210x_h */


/* PINSEL0 register setting flags */

#define PS0_P0_0_GPIO		0x00000000
#define PS0_P0_0_TXD_UART_0	0x00000001
#define PS0_P0_0_PWM_1		0x00000002

#define PS0_P0_1_GPIO		0x00000000
#define PS0_P0_1_RXD_UART_0	0x00000004
#define PS0_P0_1_PWM_3		0x00000008
#define PS0_P0_1_EINT_0		0x0000000c

#define PS0_P0_2_GPIO		0x00000000
#define PS0_P0_2_SCL_I2C_0	0x00000010
#define PS0_P0_2_CAPTURE_00	0x00000020

#define PS0_P0_3_GPIO		0x00000000
#define PS0_P0_3_SDA_I2C_0	0x00000040
#define PS0_P0_3_MATCH_0_0	0x00000080
#define PS0_P0_3_EINT_1		0x000000c0

#define PS0_P0_4_GPIO		0x00000000
#define PS0_P0_4_SCK_0		0x00000100
#define PS0_P0_4_CAPTURE_0_1	0x00000200
#define PS0_P0_4_AD_06		0x00000300

#define PS0_P0_5_GPIO		0x00000000
#define PS0_P0_5_MISO_0		0x00000400
#define PS0_P0_5_MATCH_0_1	0x00000800
#define PS0_P0_5_AD_0_7		0x00000c00

#define PS0_P0_6_GPIO		0x00000000
#define PS0_P0_6_MOSI_0		0x00001000
#define PS0_P0_6_CAPTURE_0_2	0x00002000
#define PS0_P0_6_AD_1_0		0x00003000

#define PS0_P0_7_GPIO		0x00000000
#define PS0_P0_7_SSEL_0		0x00004000
#define PS0_P0_7_PWM_2		0x00008000
#define PS0_P0_7_EINT_2		0x0000c000

#define PS0_P0_8_GPIO		0x00000000
#define PS0_P0_8_TDX_UART_1	0x00010000
#define PS0_P0_8_PWM_4		0x00020000
#define PS0_P0_8_AD_1_1		0x00030000

#define PS0_P0_9_GPIO		0x00000000
#define PS0_P0_9_RDX_UART_1	0x00040000
#define PS0_P0_9_PWM_6		0x00080000
#define PS0_P0_9_EINT_3		0x000c0000

#define PS0_P0_10_GPIO		0x00000000
#define PS0_P0_10_RTS_UART_1	0x00100000
#define PS0_P0_10_CAPTURE_1_0	0x00200000
#define PS0_P0_10_AD_1_2	0x00300000

#define PS0_P0_11_GPIO		0x00000000
#define PS0_P0_11_CTS_UART_1	0x00400000
#define PS0_P0_11_CAPTURE_1_1	0x00800000
#define PS0_P0_11_SCL_I2C_1	0x00c00000

#define PS0_P0_12_GPIO		0x00000000
#define PS0_P0_12_DSR_UART_1	0x01000000
#define PS0_P0_12_MATCH_1_0	0x02000000
#define PS0_P0_12_AD_1_3	0x03000000

#define PS0_P0_13_GPIO		0x00000000
#define PS0_P0_13_DTR_UART_1	0x04000000
#define PS0_P0_13_MATCH_1_1	0x08000000
#define PS0_P0_13_AD_1_4	0x0c000000

#define PS0_P0_14_GPIO		0x00000000
#define PS0_P0_14_DCD_UART_1	0x10000000
#define PS0_P0_14_EINT_1	0x20000000
#define PS0_P0_14_SDA_I2C_1	0x30000000

#define PS0_P0_15_GPIO		0x00000000
#define PS0_P0_15_RI_UART_1	0x40000000
#define PS0_P0_15_EINT_2	0x80000000
#define PS0_P0_15_AD_1_5	0xc0000000


/* PINSEL1 register setting flags */

#define PS1_P0_16_GPIO		0x00000000
#define PS1_P0_16_EINT_0	0x00000001
#define PS1_P0_16_MATCH_0_2	0x00000002
#define PS1_P0_16_CAPTURE_0_2	0x00000003

#define PS1_P0_17_GPIO		0x00000000
#define PS1_P0_17_CAPTURE_1_2	0x00000004
#define PS1_P0_17_SCK_1		0x00000008
#define PS1_P0_17_MATCH_1_2	0x0000000c

#define PS1_P0_18_GPIO		0x00000000
#define PS1_P0_18_CAPTURE_1_3	0x00000010
#define PS1_P0_18_MISO_1	0x00000020
#define PS1_P0_18_MATCH_1_3	0x00000030

#define PS1_P0_19_GPIO		0x00000000
#define PS1_P0_19_MATCH_1_2	0x00000040
#define PS1_P0_19_MOSI_1	0x00000080
#define PS1_P0_19_CAPTURE_1_2	0x000000c0

#define PS1_P0_20_GPIO		0x00000000
#define PS1_P0_20_MATCH_1_3	0x00000100
#define PS1_P0_20_SSEL_1	0x00000200
#define PS1_P0_20_EINT_3	0x00000300

#define PS1_P0_21_GPIO		0x00000000
#define PS1_P0_21_PWM_5		0x00000400
#define PS1_P0_21_AD_1_6	0x00000800
#define PS1_P0_21_CAPTURE_1_3	0x00000c00

#define PS1_P0_22_GPIO		0x00000000
#define PS1_P0_22_AD_1_7	0x00001000
#define PS1_P0_22_CAPTURE_0_0	0x00002000
#define PS1_P0_22_MATCH_0_0	0x00003000

#define PS1_P0_23_GPIO		0x00000000
#define PS1_P0_23_V_BUS		0x00004000

