tonyao-/coreipm/coreipm/lpc23nn.h
#define PS1_P0_25_GPIO		0x00000000
#define PS1_P0_25_AD_0_4	0x00040000
#define PS1_P0_25_DAC_A_OUT 	0x00080000

#define PS1_P0_28_GPIO		0x00000000
#define PS1_P0_28_AD_0_1	0x01000000
#define PS1_P0_28_CAPTURE_0_2	0x02000000
#define PS1_P0_28_MATCH_0_2	0x03000000

#define PS1_P0_29_GPIO		0x00000000
#define PS1_P0_29_AD_0_2	0x04000000
#define PS1_P0_29_CAPTURE_0_3	0x08000000
#define PS1_P0_29_MATCH_0_3	0x0c000000

#define PS1_P0_30_GPIO		0x00000000
#define PS1_P0_30_AD_0_3	0x10000000
#define PS1_P0_30_EINT_3	0x20000000
#define PS1_P0_30_CAPTURE_0_0	0x30000000

#define PS1_P0_31_GPIO		0x00000000
#define PS1_P0_31_UP_LED	0x40000000
#define PS1_P0_31_CONNECT	0x80000000
#define PS1_P0_31_AD_1_5	0xc0000000

/* PINSEL2 register setting flags */
#define PS2_P1_26_36_GPIO	0x00000000
#define PS2_P1_26_36_DEBUG	0x00000004
#define PS2_P1_16_25_GPIO	0x00000000
#define PS2_P1_16_25_TRACE	0x00000008



#define P0_0	0x00000001	// P0.0
#define P0_1	0x00000002	// P0.1
#define P0_2	0x00000004	// P0.2
#define P0_3	0x00000008	// P0.3
#define P0_4	0x00000010	// P0.4
#define P0_5	0x00000020	// P0.5
#define P0_6	0x00000040	// P0.6
#define P0_7	0x00000080	// P0.7
#define P0_8	0x00000100	// P0.8
#define P0_9	0x00000200	// P0.9
#define P0_10	0x00000400	// P0.10
#define P0_11	0x00000800	// P0.11
#define P0_12	0x00001000	// P0.12
#define P0_13	0x00002000	// P0.13
#define P0_14	0x00004000	// P0.14
#define P0_15	0x00008000	// P0.15
#define P0_16	0x00010000	// P0.16
#define P0_17	0x00020000	// P0.17
#define P0_18	0x00040000	// P0.18
#define P0_19	0x00080000	// P0.19
#define P0_20	0x00100000	// P0.20
#define P0_21	0x00200000	// P0.21
#define P0_22	0x00400000	// P0.22
#define P0_23	0x00800000	// P0.23
#define P0_24	0x01000000	// P0.24
#define P0_25	0x02000000	// P0.25
#define P0_26	0x04000000	// P0.26
#define P0_27	0x08000000	// P0.27
#define P0_28	0x10000000	// P0.28
#define P0_29	0x20000000	// P0.29
#define P0_30	0x40000000	// P0.30
#define P0_31	0x80000000	// P0.31

#define P1_0	0x0000000100000000	// P1.0
#define P1_1	0x0000000200000000	// P1.1
#define P1_2	0x0000000400000000	// P1.2
#define P1_3	0x0000000800000000	// P1.3
#define P1_4	0x0000001000000000	// P1.4
#define P1_5	0x0000002000000000	// P1.5
#define P1_6	0x0000004000000000	// P1.6
#define P1_7	0x0000008000000000	// P1.7
#define P1_8	0x0000010000000000	// P1.8
#define P1_9	0x0000020000000000	// P1.9
#define P1_10	0x0000040000000000	// P1.10
#define P1_11	0x0000080000000000	// P1.11
#define P1_12	0x0000100000000000	// P1.12
#define P1_13	0x0000200000000000	// P1.13
#define P1_14	0x0000400000000000	// P1.14
#define P1_15	0x0000800000000000	// P1.15
#define P1_16	0x0001000000000000	// P1.16
#define P1_17	0x0002000000000000	// P1.17
#define P1_18	0x0004000000000000	// P1.18
#define P1_19	0x0008000000000000	// P1.19
#define P1_20	0x0010000000000000	// P1.20
#define P1_21	0x0020000000000000	// P1.21
#define P1_22	0x0040000000000000	// P1.22
#define P1_23	0x0080000000000000	// P1.23
#define P1_24	0x0100000000000000	// P1.24
#define P1_25	0x0200000000000000	// P1.25
#define P1_26	0x0400000000000000	// P1.26
#define P1_27	0x0800000000000000	// P1.27
#define P1_28	0x1000000000000000	// P1.28
#define P1_29	0x2000000000000000	// P1.29
#define P1_30	0x4000000000000000	// P1.30
#define P1_31	0x8000000000000000	// P1.31

#define P4_29	0	// TODO FIX



